import unittest
from src.lab5.validator import Validator

class TestValidator(unittest.TestCase):
    def test_should_validate(self):
        orders = [['3', 'сыр, колбаса, сыр', 'ФИО', 'Франция. Париж. Париж-кроссинг. Дом 1', '+7-131-234-56-78', 'MAX'],
                  ['4', 'сыр, колбаса, колбаса', 'ФИО', 'Россия. Москва. улица Пушкина. Дом колотушкина', '+7-133-869-36-51', 'MIDDLE'],
                  ['5', 'сыр', 'ФИО', 'Россия. Москва. улица Пушкина', '+7-131-234-56-78', 'MAX'],
                  ['6', 'сыр, колбаса, сыр, молоко, молоко', 'ФИО', 'Великобритания. Англия. Лондон. Бейкер-стрит', '+7-994-924-65-90', 'LOW'],
                  ['7', 'сыр, колбаса, сыр, молоко, молоко', 'ФИО', 'Великобритания. Англия. Лондон. Бейкер-стрит', '+7-994-9284-65-90', 'MAX']]

        expected_valid_orders = [['4',
                                  'сыр x1, колбаса x2',
                                  'ФИО',
                                  'Россия. Москва. улица Пушкина. Дом колотушкина',
                                  '+7-133-869-36-51',
                                  'MIDDLE'],
                                 ['6',
                                  'сыр x2, колбаса x1, молоко x2',
                                  'ФИО',
                                  'Великобритания. Англия. Лондон. Бейкер-стрит',
                                  '+7-994-924-65-90',
                                  'LOW'],
                                 ['3',
                                  'сыр x2, колбаса x1',
                                  'ФИО',
                                  'Франция. Париж. Париж-кроссинг. Дом 1',
                                  '+7-131-234-56-78',
                                  'MAX']]

        expected_invalid_orders = ["5;1;Россия. Москва. улица Пушкина",
                                   "7;2;+7-994-9284-65-90"]

        obj = Validator(orders)
        result = obj.validate()
        orders_valid = result[0]
        orders_invalid = result[1]

        self.assertEqual(orders_valid, expected_valid_orders)
        self.assertEqual(orders_invalid, expected_invalid_orders)
